# Connection API

The IDEA StatiCa Connection API is a REST API (OpenAPI 3) for automating the design and code-checking of steel connections in IDEA StatiCa Connection. It is exposed by a service that runs locally on your machine and ships with the IDEA StatiCa desktop installation.

> [!TIP]
> New to the API? Jump straight to Getting started — install the SDK, run the service, and calculate your first connection in C# or Python.

The Connection API has been available since **IDEA StatiCa 24.1**. In IDEA StatiCa 26.1 the API version is **5.0** and all endpoints live under the `/api/5/` base path. Older product versions serve older API versions (24.1 shipped API 1.0 under `/api/1/`, 26.0 shipped API 4.0 under `/api/4/`), which is another reason the SDK package version must match the installed product version.

Every version the service ever shipped is still served by the current service, but versions below the current one are **deprecated**: each response to them carries an `api-deprecated-versions` header, the Swagger UI of the service (`http://localhost:5000`) labels them, and a deprecated version is removed one release after its deprecation. New scripts should always target the current version, which the matching SDK package does by itself.

## API architecture

The API is served by a locally hosted REST service, `IdeaStatiCa.ConnectionRestApi.exe`, located in the IDEA StatiCa installation folder (for example `C:\Program Files\IDEA StatiCa\StatiCa 26.0`). The service communicates over HTTP, by default at `http://localhost:5000`, and is described by an OpenAPI 3 specification. A Swagger UI runs on the service itself, so you can explore and try every endpoint interactively in a browser.

Your application connects as a client, opens a project in the service, works with it through REST resources (connections, members, operations, templates, parameters, load effects, results, reports), and closes it when done. See Concepts for the full service and project lifecycle.

## Clients

You can call the REST API directly from any programming language, but we recommend one of the official SDK clients:

| Client | Package | Requirements |
| --- | --- | --- |
| C# / .NET | NuGet: IdeaStatiCa.ConnectionApi | .NET Standard 2.0 or 2.1 compatible runtime |
| Python | pip: ideastatica-connection-api | Python 3.8 or later |

Both clients handle connecting to the service, client identification, project lifecycle, and file upload/download for you, and add convenience wrappers on top of the generated API (for example, opening a project directly from a file path or saving a report straight to disk).

> [!IMPORTANT]
> The SDK clients are published per IDEA StatiCa version. Always install the SDK package version that matches the IDEA StatiCa version installed on the machine running the service — for example, with IDEA StatiCa 26.0 installed, use a 26.0.x package. Mixing SDK and service versions is the most common cause of unexpected errors.

## What you can do

The API is organized into 16 resource groups:

* **Projects** — open existing `.ideaCon` files, create empty projects, import a project from an IDEA Open Model (IOM) file, update a project from IOM, and download the modified project.
* **Connections and members** — list, create, update, copy, and delete connections; query and update members; set the bearing member; get connection topology and production cost.
* **Calculation and results** — run the CBFEM analysis and read a pass/fail summary, detailed results, or the raw check results as JSON.
* **Manufacturing operations** — list the operations in a connection, read and update their common properties, delete all operations, and pre-design welds (weld sizing).
* **Templates** — create a template from an existing connection, apply a template to another connection with parameter mapping, explode or delete applied templates, and load template defaults.
* **Connection Library** — browse design sets, let the service propose suitable design items for a connection, retrieve templates and preview pictures, and publish your own designs to a private or company set.
* **Design-code conversion** — get the default conversion mapping and convert a whole project to a different design code.
* **Materials and cross-sections** — list the steel, concrete, bolt, and weld materials, bolt assemblies, and cross-sections used in a project, and add new ones from the material and product range library (MPRL).
* **Parameters** — read and update design parameters, evaluate expressions, and delete parameters. See the parameters getting started guide and the expression reference.
* **Load effects** — create, read, update, and delete load effects, and get or set load settings such as loads in equilibrium.
* **Reports** — generate PDF or Word reports for a single connection or for multiple connections at once, and an HTML (zip) report for a single connection.
* **Exports** — export a connection to IOM, IOM connection data, or IFC.
* **3D presentation** — retrieve scene data for rendering the connection in your own viewer.
* **Settings** — read and update project-level settings.
* **Client and service info** — connect a client and query the service version.

> [!NOTE]
> The public API does not expose endpoints for adding individual plates, bolts, welds, or cuts. Connection geometry is authored by applying templates, by using the Connection Library propose workflow, or by importing a project from IOM with connection data; members can also be added and updated directly. See Concepts for details.

## API history

* **24.1** — The REST Connection API was introduced. It replaces the older ConnHiddenCalculator API from `IdeaStatiCa.Plugin`, which is obsolete; its client code was removed from the repository (the client was deleted in February 2025, the last obsolete interface in January 2026). If you are migrating from it, start with Getting started.
* **After 24.1** — Later releases extended the API with the Connection Library (propose and publish), design-code conversion, project settings endpoints, template sub-resources (create from connection, explode, load defaults, per-template common properties), and weld sizing pre-design.

If you are on an older version of IDEA StatiCa, we recommend updating to the latest version and the matching SDK package.

## Resources

* Getting started — install, run the service, and write your first script in C# or Python.
* Concepts — service lifecycle, projects, templates, parameters, results, and how the domain model maps to REST resources.
* Examples — annotated catalog of all C# and Python examples.
* C# client reference and Python client reference
* OpenAPI specification — the machine-readable contract for the whole API (source on GitHub). The running service also serves the spec itself, through the Swagger UI at its root URL.
* GitHub Discussions — questions, bug reports, and feature requests.

## AI assistants

* LLM reference — a single-page, verified reference of the Python SDK surface, designed to be pasted into an AI assistant's context.
* Using ChatGPT? Try the official IDEA StatiCa Connection API Assistant for Python, a custom GPT that helps you write Python scripts for the Connection API.